#### OpenTofu Format and Style 🖌`failure`
#### OpenTofu Initialization ⚙️`success`
#### OpenTofu Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.

```

</details>

#### OpenTofu Plan 📖`success`

<details><summary>Show Plan</summary>

```

tofu
cloudflare_record.subdomain["npm"]: Refreshing state... [id=b99a2bb1e555c12fcf6d94f9347be393]
cloudflare_record.subdomain["jacket"]: Refreshing state... [id=afa8dd1454d4c9c99aefdb1344245ceb]
cloudflare_record.subdomain["kuma"]: Refreshing state... [id=52f177c46c416f2250cb99eceebab121]
cloudflare_record.subdomain["bazar"]: Refreshing state... [id=b565ead9cb19d4502c42083a23558ae2]
cloudflare_record.subdomain["radar"]: Refreshing state... [id=5c4d56a21aa6a866fb1c223fc79bb734]
cloudflare_record.subdomain["sonar"]: Refreshing state... [id=3ed42ace05dfa2018fc6c0d4fc57a9e0]
cloudflare_record.subdomain["transmission"]: Refreshing state... [id=abedda32f39e67709781e7dc14b9c591]
cloudflare_record.subdomain["comp-netdata"]: Refreshing state... [id=56864ccc12d1e465020e60b125f5af08]
cloudflare_record.subdomain["readar"]: Refreshing state... [id=8513ef72d52c23916a7765c44e9c32e1]
cloudflare_record.subdomain["compartilhado"]: Refreshing state... [id=84a0913e6314eca98739e525271fbbf5]
cloudflare_record.subdomain["portainer"]: Refreshing state... [id=70c2312d527124f3987fc479e9b323da]
cloudflare_record.subdomain["jellyfin"]: Refreshing state... [id=9b818422abd967141296f1287461c7e8]

OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

OpenTofu will perform the following actions:

  # cloudflare_record.subdomain["minio"] will be created
  + resource "cloudflare_record" "subdomain" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "minio.atoca.house"
      + proxiable       = (known after apply)
      + proxied         = false
      + ttl             = (known after apply)
      + type            = "A"
      + value           = (sensitive value)
      + zone_id         = (sensitive value)
    }

  # cloudflare_record.subdomain["s3"] will be created
  + resource "cloudflare_record" "subdomain" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "s3.atoca.house"
      + proxiable       = (known after apply)
      + proxied         = false
      + ttl             = (known after apply)
      + type            = "A"
      + value           = (sensitive value)
      + zone_id         = (sensitive value)
    }

Plan: 2 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so OpenTofu can't
guarantee to take exactly these actions if you run "tofu apply" now.

```

</details>

*Pusher: @guilhermewolf, Action: `pull_request`, Working Directory: ``, Workflow: `OpenTofu Plan`*